[Killed] BlockStatement
src/gilded_rose.js:13:16
 const Quality = {
   MIN: 0,
   MAX: 50,
-  clamp(value) {
-    if (value < this.MIN) return this.MIN;
-    if (value > this.MAX) return this.MAX;
-    return value;
-  }
+  clamp(value) {}
 };
 
killedBy: Gilded Rose - comprehensive suite Normal items quality and sellIn decrease by 1 before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: undefined

[Killed] ConditionalExpression
src/gilded_rose.js:14:9
   MIN: 0,
   MAX: 50,
   clamp(value) {
-    if (value < this.MIN) return this.MIN;
+    if (true) return this.MIN;
     if (value > this.MAX) return this.MAX;
     return value;
killedBy: Gilded Rose - comprehensive suite Normal items quality and sellIn decrease by 1 before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 0

[Killed] EqualityOperator
src/gilded_rose.js:14:9
   MIN: 0,
   MAX: 50,
   clamp(value) {
-    if (value < this.MIN) return this.MIN;
+    if (value >= this.MIN) return this.MIN;
     if (value > this.MAX) return this.MAX;
     return value;
killedBy: Gilded Rose - comprehensive suite Normal items quality and sellIn decrease by 1 before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 0

[Killed] ConditionalExpression
src/gilded_rose.js:15:9
   MAX: 50,
   clamp(value) {
     if (value < this.MIN) return this.MIN;
-    if (value > this.MAX) return this.MAX;
+    if (false) return this.MAX;
     return value;
   }
killedBy: Gilded Rose - comprehensive suite Aged Brie initial quality above 50 is clamped down to 50 after update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 50
Received: 55

[Killed] EqualityOperator
src/gilded_rose.js:15:9
   MAX: 50,
   clamp(value) {
     if (value < this.MIN) return this.MIN;
-    if (value > this.MAX) return this.MAX;
+    if (value <= this.MAX) return this.MAX;
     return value;
   }
killedBy: Gilded Rose - comprehensive suite Normal items quality and sellIn decrease by 1 before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 50

[Killed] BlockStatement
src/gilded_rose.js:22:16
 
 // Strategy base class
 class ItemUpdater {
-  update(item) {
-    this.updateBeforeSellIn(item);
-
-    if (!this.isSulfuras(item)) {
-      item.sellIn -= 1;
-    }
-
-    if (item.sellIn < 0) {
-      this.updateAfterSellIn(item);
-    }
-
-    item.quality = Quality.clamp(item.quality);
-  }
+  update(item) {}
 
   updateBeforeSellIn(/* item */) {}
killedBy: Gilded Rose - comprehensive suite Normal items quality and sellIn decrease by 1 before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 5

[Killed] BlockStatement
src/gilded_rose.js:25:33
   update(item) {
     this.updateBeforeSellIn(item);
 
-    if (!this.isSulfuras(item)) {
-      item.sellIn -= 1;
-    }
+    if (!this.isSulfuras(item)) {}
 
     if (item.sellIn < 0) {
killedBy: Gilded Rose - comprehensive suite Normal items quality and sellIn decrease by 1 before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 5

[Killed] BooleanLiteral
src/gilded_rose.js:25:9
   update(item) {
     this.updateBeforeSellIn(item);
 
-    if (!this.isSulfuras(item)) {
+    if (this.isSulfuras(item)) {
       item.sellIn -= 1;
     }
killedBy: Gilded Rose - comprehensive suite Normal items quality and sellIn decrease by 1 before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 5

[Killed] AssignmentOperator
src/gilded_rose.js:26:7
     this.updateBeforeSellIn(item);
 
     if (!this.isSulfuras(item)) {
-      item.sellIn -= 1;
+      item.sellIn += 1;
     }
 
killedBy: Gilded Rose - comprehensive suite Normal items quality and sellIn decrease by 1 before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 6

[Killed] EqualityOperator
src/gilded_rose.js:29:9
       item.sellIn -= 1;
     }
 
-    if (item.sellIn < 0) {
+    if (item.sellIn <= 0) {
       this.updateAfterSellIn(item);
     }
killedBy: Gilded Rose - comprehensive suite multiple items are processed independently
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] BlockStatement
src/gilded_rose.js:40:30
   updateAfterSellIn(/* item */) {}
 
   /* istanbul ignore next */
-  increase(item, amount = 1) {
-    item.quality += amount;
-  }
+  increase(item, amount = 1) {}
   /* istanbul ignore next */
   decrease(item, amount = 1) {
killedBy: Gilded Rose - comprehensive suite Aged Brie increases in quality before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] AssignmentOperator
src/gilded_rose.js:41:5
 
   /* istanbul ignore next */
   increase(item, amount = 1) {
-    item.quality += amount;
+    item.quality -= amount;
   }
   /* istanbul ignore next */
killedBy: Gilded Rose - comprehensive suite Aged Brie increases in quality before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/gilded_rose.js:44:30
     item.quality += amount;
   }
   /* istanbul ignore next */
-  decrease(item, amount = 1) {
-    item.quality -= amount;
-  }
+  decrease(item, amount = 1) {}
 
   isSulfuras(item) {
killedBy: Gilded Rose - comprehensive suite Normal items quality and sellIn decrease by 1 before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 10

[Killed] AssignmentOperator
src/gilded_rose.js:45:5
   }
   /* istanbul ignore next */
   decrease(item, amount = 1) {
-    item.quality -= amount;
+    item.quality += amount;
   }
 
killedBy: Gilded Rose - comprehensive suite Normal items quality and sellIn decrease by 1 before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 11

[Killed] BlockStatement
src/gilded_rose.js:48:20
     item.quality -= amount;
   }
 
-  isSulfuras(item) {
-    return item.name === 'Sulfuras, Hand of Ragnaros';
-  }
+  isSulfuras(item) {}
 }
 
killedBy: Gilded Rose - comprehensive suite internal updaters and edge branches ItemUpdater.update respects isSulfuras branch (no decrement)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 4

[Killed] ConditionalExpression
src/gilded_rose.js:49:12
   }
 
   isSulfuras(item) {
-    return item.name === 'Sulfuras, Hand of Ragnaros';
+    return true;
   }
 }
killedBy: Gilded Rose - comprehensive suite Normal items quality and sellIn decrease by 1 before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 5

[Killed] ConditionalExpression
src/gilded_rose.js:49:12
   }
 
   isSulfuras(item) {
-    return item.name === 'Sulfuras, Hand of Ragnaros';
+    return false;
   }
 }
killedBy: Gilded Rose - comprehensive suite internal updaters and edge branches ItemUpdater.update respects isSulfuras branch (no decrement)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 4

[Killed] BlockStatement
src/gilded_rose.js:54:28
 }
 
 class NormalUpdater extends ItemUpdater {
-  updateBeforeSellIn(item) {
-    if (item.quality > 0 && !this.isSulfuras(item)) {
-      this.decrease(item, 1);
-    }
-  }
+  updateBeforeSellIn(item) {}
 
   updateAfterSellIn(item) {
killedBy: Gilded Rose - comprehensive suite Normal items quality and sellIn decrease by 1 before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 10

[Killed] ConditionalExpression
src/gilded_rose.js:55:9
 
 class NormalUpdater extends ItemUpdater {
   updateBeforeSellIn(item) {
-    if (item.quality > 0 && !this.isSulfuras(item)) {
+    if (false) {
       this.decrease(item, 1);
     }
killedBy: Gilded Rose - comprehensive suite Normal items quality and sellIn decrease by 1 before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: 10

[Killed] LogicalOperator
src/gilded_rose.js:55:9
 
 class NormalUpdater extends ItemUpdater {
   updateBeforeSellIn(item) {
-    if (item.quality > 0 && !this.isSulfuras(item)) {
+    if (item.quality > 0 || !this.isSulfuras(item)) {
       this.decrease(item, 1);
     }
killedBy: Gilded Rose - comprehensive suite internal updaters and edge branches NormalUpdater does nothing for Sulfuras item (branch)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 9

[Killed] BlockStatement
src/gilded_rose.js:60:27
     }
   }
 
-  updateAfterSellIn(item) {
-    if (item.quality > 0 && !this.isSulfuras(item)) {
-      this.decrease(item, 1);
-    }
-  }
+  updateAfterSellIn(item) {}
 }
 
killedBy: Gilded Rose - comprehensive suite Normal items quality degrades twice after sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 9

[Killed] ConditionalExpression
src/gilded_rose.js:61:9
   }
 
   updateAfterSellIn(item) {
-    if (item.quality > 0 && !this.isSulfuras(item)) {
+    if (false) {
       this.decrease(item, 1);
     }
killedBy: Gilded Rose - comprehensive suite Normal items quality degrades twice after sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 9

[Killed] BooleanLiteral
src/gilded_rose.js:61:29
   }
 
   updateAfterSellIn(item) {
-    if (item.quality > 0 && !this.isSulfuras(item)) {
+    if (item.quality > 0 && this.isSulfuras(item)) {
       this.decrease(item, 1);
     }
killedBy: Gilded Rose - comprehensive suite Normal items quality degrades twice after sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 9

[Killed] BlockStatement
src/gilded_rose.js:68:28
 }
 
 class AgedBrieUpdater extends ItemUpdater {
-  updateBeforeSellIn(item) {
-    if (item.quality < Quality.MAX) {
-      this.increase(item, 1);
-    }
-  }
+  updateBeforeSellIn(item) {}
 
   /* istanbul ignore next */
killedBy: Gilded Rose - comprehensive suite Aged Brie increases in quality before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/gilded_rose.js:69:37
 
 class AgedBrieUpdater extends ItemUpdater {
   updateBeforeSellIn(item) {
-    if (item.quality < Quality.MAX) {
-      this.increase(item, 1);
-    }
+    if (item.quality < Quality.MAX) {}
   }
 
killedBy: Gilded Rose - comprehensive suite Aged Brie increases in quality before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
src/gilded_rose.js:69:9
 
 class AgedBrieUpdater extends ItemUpdater {
   updateBeforeSellIn(item) {
-    if (item.quality < Quality.MAX) {
+    if (item.quality >= Quality.MAX) {
       this.increase(item, 1);
     }
killedBy: Gilded Rose - comprehensive suite Aged Brie increases in quality before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/gilded_rose.js:75:27
   }
 
   /* istanbul ignore next */
-  updateAfterSellIn(item) {
-    if (item.quality < Quality.MAX) {
-      this.increase(item, 1);
-    }
-  }
+  updateAfterSellIn(item) {}
 }
 
killedBy: Gilded Rose - comprehensive suite Aged Brie increases twice in quality after sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] EqualityOperator
src/gilded_rose.js:76:9
 
   /* istanbul ignore next */
   updateAfterSellIn(item) {
-    if (item.quality < Quality.MAX) {
+    if (item.quality >= Quality.MAX) {
       this.increase(item, 1);
     }
killedBy: Gilded Rose - comprehensive suite Aged Brie increases twice in quality after sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
src/gilded_rose.js:76:37
 
   /* istanbul ignore next */
   updateAfterSellIn(item) {
-    if (item.quality < Quality.MAX) {
-      this.increase(item, 1);
-    }
+    if (item.quality < Quality.MAX) {}
   }
 }
killedBy: Gilded Rose - comprehensive suite Aged Brie increases twice in quality after sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] BlockStatement
src/gilded_rose.js:83:28
 }
 
 class BackstageUpdater extends ItemUpdater {
-  updateBeforeSellIn(item) {
-    if (item.quality < Quality.MAX) {
-      this.increase(item, 1);
-
-      if (item.sellIn < 11 && item.quality < Quality.MAX) {
-        this.increase(item, 1);
-      }
-
-      if (item.sellIn < 6 && item.quality < Quality.MAX) {
-        this.increase(item, 1);
-      }
-    }
-  }
+  updateBeforeSellIn(item) {}
 
   updateAfterSellIn(item) {
killedBy: Gilded Rose - comprehensive suite Backstage passes increases by 1 when sellIn > 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 20

[Killed] BlockStatement
src/gilded_rose.js:84:37
 
 class BackstageUpdater extends ItemUpdater {
   updateBeforeSellIn(item) {
-    if (item.quality < Quality.MAX) {
-      this.increase(item, 1);
-
-      if (item.sellIn < 11 && item.quality < Quality.MAX) {
-        this.increase(item, 1);
-      }
-
-      if (item.sellIn < 6 && item.quality < Quality.MAX) {
-        this.increase(item, 1);
-      }
-    }
+    if (item.quality < Quality.MAX) {}
   }
 
killedBy: Gilded Rose - comprehensive suite Backstage passes increases by 1 when sellIn > 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 20

[Killed] BlockStatement
src/gilded_rose.js:87:59
     if (item.quality < Quality.MAX) {
       this.increase(item, 1);
 
-      if (item.sellIn < 11 && item.quality < Quality.MAX) {
-        this.increase(item, 1);
-      }
+      if (item.sellIn < 11 && item.quality < Quality.MAX) {}
 
       if (item.sellIn < 6 && item.quality < Quality.MAX) {
killedBy: Gilded Rose - comprehensive suite Backstage passes increases by 2 when 6 <= sellIn <= 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 22
Received: 21

[Killed] LogicalOperator
src/gilded_rose.js:87:11
     if (item.quality < Quality.MAX) {
       this.increase(item, 1);
 
-      if (item.sellIn < 11 && item.quality < Quality.MAX) {
+      if (item.sellIn < 11 || item.quality < Quality.MAX) {
         this.increase(item, 1);
       }
killedBy: Gilded Rose - comprehensive suite Backstage passes increases by 1 when sellIn > 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 22

[Killed] BlockStatement
src/gilded_rose.js:91:58
         this.increase(item, 1);
       }
 
-      if (item.sellIn < 6 && item.quality < Quality.MAX) {
-        this.increase(item, 1);
-      }
+      if (item.sellIn < 6 && item.quality < Quality.MAX) {}
     }
   }
killedBy: Gilded Rose - comprehensive suite Backstage passes increases by 3 when 0 <= sellIn <= 5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 23
Received: 22

[Killed] ConditionalExpression
src/gilded_rose.js:91:11
         this.increase(item, 1);
       }
 
-      if (item.sellIn < 6 && item.quality < Quality.MAX) {
+      if (true) {
         this.increase(item, 1);
       }
killedBy: Gilded Rose - comprehensive suite Backstage passes increases by 1 when sellIn > 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 22

[Killed] BlockStatement
src/gilded_rose.js:97:27
     }
   }
 
-  updateAfterSellIn(item) {
-    // After the concert, quality drops to 0
-    item.quality = 0;
-  }
+  updateAfterSellIn(item) {}
 }
 
killedBy: Gilded Rose - comprehensive suite Backstage passes quality drops to 0 after the concert
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 23

[Survived] BlockStatement
src/gilded_rose.js:104:16
 }
 
 class SulfurasUpdater extends ItemUpdater {
-  update(item) {
-    // Legendary item: never changes
-    return;
-  }
+  update(item) {}
 }
 

[Killed] BlockStatement
src/gilded_rose.js:112:27
 
 // Factory para escolher o updater apropriado
 class UpdaterFactory {
-  static getUpdater(item) {
-    switch (item.name) {
-      case 'Aged Brie':
-        return new AgedBrieUpdater();
-      case 'Backstage passes to a TAFKAL80ETC concert':
-        return new BackstageUpdater();
-      case 'Sulfuras, Hand of Ragnaros':
-        return new SulfurasUpdater();
-      default:
-        return new NormalUpdater();
-    }
-  }
+  static getUpdater(item) {}
 }
 
killedBy: Gilded Rose - comprehensive suite updateQuality returns the same items array instance
statusReason: TypeError: Cannot read properties of undefined (reading 'update')

[Killed] ConditionalExpression
src/gilded_rose.js:114:7
 class UpdaterFactory {
   static getUpdater(item) {
     switch (item.name) {
-      case 'Aged Brie':
-        return new AgedBrieUpdater();
+      case 'Aged Brie':
       case 'Backstage passes to a TAFKAL80ETC concert':
         return new BackstageUpdater();
killedBy: Gilded Rose - comprehensive suite Aged Brie increases in quality before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 3

[Killed] ConditionalExpression
src/gilded_rose.js:116:7
     switch (item.name) {
       case 'Aged Brie':
         return new AgedBrieUpdater();
-      case 'Backstage passes to a TAFKAL80ETC concert':
-        return new BackstageUpdater();
+      case 'Backstage passes to a TAFKAL80ETC concert':
       case 'Sulfuras, Hand of Ragnaros':
         return new SulfurasUpdater();
killedBy: Gilded Rose - comprehensive suite Backstage passes increases by 1 when sellIn > 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 14
Received: 15

[Killed] StringLiteral
src/gilded_rose.js:116:12
     switch (item.name) {
       case 'Aged Brie':
         return new AgedBrieUpdater();
-      case 'Backstage passes to a TAFKAL80ETC concert':
+      case "":
         return new BackstageUpdater();
       case 'Sulfuras, Hand of Ragnaros':
killedBy: Gilded Rose - comprehensive suite Backstage passes increases by 1 when sellIn > 10
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 21
Received: 19

[Killed] ConditionalExpression
src/gilded_rose.js:118:7
         return new AgedBrieUpdater();
       case 'Backstage passes to a TAFKAL80ETC concert':
         return new BackstageUpdater();
-      case 'Sulfuras, Hand of Ragnaros':
-        return new SulfurasUpdater();
+      case 'Sulfuras, Hand of Ragnaros':
       default:
         return new NormalUpdater();
killedBy: Gilded Rose - comprehensive suite Sulfuras never changes quality or sellIn
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 80
Received: 50

[Killed] StringLiteral
src/gilded_rose.js:118:12
         return new AgedBrieUpdater();
       case 'Backstage passes to a TAFKAL80ETC concert':
         return new BackstageUpdater();
-      case 'Sulfuras, Hand of Ragnaros':
+      case "":
         return new SulfurasUpdater();
       default:
killedBy: Gilded Rose - comprehensive suite Sulfuras never changes quality or sellIn
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 80
Received: 50

[Killed] ConditionalExpression
src/gilded_rose.js:120:7
         return new BackstageUpdater();
       case 'Sulfuras, Hand of Ragnaros':
         return new SulfurasUpdater();
-      default:
-        return new NormalUpdater();
+      default:
     }
   }
killedBy: Gilded Rose - comprehensive suite updateQuality returns the same items array instance
statusReason: TypeError: Cannot read properties of undefined (reading 'update')

[Killed] BlockStatement
src/gilded_rose.js:131:19
     this.items = items;
   }
 
-  updateQuality() {
-    for (let i = 0; i < this.items.length; i++) {
-      const item = this.items[i];
-      const updater = UpdaterFactory.getUpdater(item);
-      updater.update(item);
-    }
-
-    return this.items;
-  }
+  updateQuality() {}
 }
 
killedBy: Gilded Rose - comprehensive suite updateQuality returns the same items array instance
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: [{"name": "foo", "quality": 1, "sellIn": 1}]
Received: undefined

[Killed] BlockStatement
src/gilded_rose.js:132:49
   }
 
   updateQuality() {
-    for (let i = 0; i < this.items.length; i++) {
-      const item = this.items[i];
-      const updater = UpdaterFactory.getUpdater(item);
-      updater.update(item);
-    }
+    for (let i = 0; i < this.items.length; i++) {}
 
     return this.items;
killedBy: Gilded Rose - comprehensive suite Normal items quality and sellIn decrease by 1 before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 5

[Killed] EqualityOperator
src/gilded_rose.js:132:21
   }
 
   updateQuality() {
-    for (let i = 0; i < this.items.length; i++) {
+    for (let i = 0; i >= this.items.length; i++) {
       const item = this.items[i];
       const updater = UpdaterFactory.getUpdater(item);
killedBy: Gilded Rose - comprehensive suite Normal items quality and sellIn decrease by 1 before sell date
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 5
